FSAndDisk_Test/FS_Disk_SSD_MP400_8TB_NVMe_scripts/mp4008TB_fs_fio_test_read_ranseq/rand_read_block_64k_64_2_jobs.out
rand_read_test: (g=0): rw=randread, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 2 processes

rand_read_test: (groupid=0, jobs=2): err= 0: pid=1372189: Mon May 13 03:17:54 2024
  read: IOPS=25.1k, BW=1568MiB/s (1644MB/s)(200GiB/130645msec)
    slat (usec): min=4, max=1037, avg=20.39, stdev= 5.32
    clat (usec): min=1980, max=13406, avg=5080.68, stdev=653.06
     lat (usec): min=1996, max=13488, avg=5101.26, stdev=653.04
    clat percentiles (usec):
     |  1.00th=[ 4228],  5.00th=[ 4359], 10.00th=[ 4424], 20.00th=[ 4555],
     | 30.00th=[ 4686], 40.00th=[ 4752], 50.00th=[ 4883], 60.00th=[ 5080],
     | 70.00th=[ 5276], 80.00th=[ 5538], 90.00th=[ 5997], 95.00th=[ 6390],
     | 99.00th=[ 7242], 99.50th=[ 7635], 99.90th=[ 8356], 99.95th=[ 8586],
     | 99.99th=[ 9372]
   bw (  MiB/s): min= 1532, max= 1575, per=100.00%, avg=1569.36, stdev= 1.61, samples=520
   iops        : min=24518, max=25204, avg=25109.81, stdev=25.74, samples=520
  lat (msec)   : 2=0.01%, 4=0.02%, 10=99.97%, 20=0.01%
  cpu          : usr=8.56%, sys=30.37%, ctx=2048196, majf=0, minf=2086
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=3276800,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=1568MiB/s (1644MB/s), 1568MiB/s-1568MiB/s (1644MB/s-1644MB/s), io=200GiB (215GB), run=130645-130645msec

Disk stats (read/write):
  nvme0n1: ios=3270527/0, merge=0/0, ticks=16565116/0, in_queue=16565115, util=100.00%

Test Time: 2024-05-13 03:17:54
Device Name: filetest.txt
Device Info: